# Definition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..Definition Property
Parameter Class See Also
---
Returns the Definition object that describes the data type, name and other details of the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Definition Definition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Definition As Definition
	Get
```

Visual C++
---
```text
public:
property Definition^ Definition {
	Definition^ get ();
}
```

# Remarks
This will always be an InternalDefinition object. If you want the Guid for a shared parameter, use GUID.
# See Also
Parameter Class
Autodesk.Revit.DB Namespace